<?php 
$studs = array(
array("Название" => "Библиотека первая","Адрес" =>"ул. Под мостом дом  0"), 
array("Название" => "Библиотека вторая","Адрес" =>"ул. БСП дом 75"),
array("Название" => "Библиотека третья","Адрес" =>"ул. Свободы дом 7"),
 );
 

   
foreach ($studs as $stud => $данные1)
  {
  echo  "<br>$stud:<br>";
  foreach ($данные1 as $параметр => $pp)
    {
    echo  "$параметр : $pp<br>";
    }
  }

    function ФИ2О()
{
  return array ("Петров П.П.", "20", "50", "30", "");
 
}

   function ФИО3()
{
  return array ("Сидоров С.С.", "214", "224", "324", "");
 
}

  function ФИО()
{
  return array ("Иванов И.И.", "1", "2", "3", "");
 
}
list ($ФИО_водителя,$Остаток_на_начало,$Получено,$Израсходовано,$Остаток_на) = ФИО();
list ($ФИО_водителя2,$Остаток_на_начало2,$Получено2,$Израсходовано2,$Остаток_на2) = ФИ2О();
list ($ФИО_водителя3,$Остаток_на_начало3,$Получено3,$Израсходовано3,$Остаток_на3) = ФИО3();
echo "<table  border=1>";
$ost = $Остаток_на_начало+$Получено-$Израсходовано;
$ost2 = $Остаток_на_начало2+$Получено2-$Израсходовано2;
$ost3 = $Остаток_на_начало3+$Получено3-$Израсходовано3;
echo "<tr><td>ФИО_водителя <td>Остаток_на_начало  <td>Получено <td>Израсходовано <td>Остаток_на";
echo "<tr><td>$ФИО_водителя2 <td>$Остаток_на_начало2  <td>$Получено2 <td>$Израсходовано2 <td>$ost2";
echo "<tr><td>$ФИО_водителя3 <td>$Остаток_на_начало3  <td>$Получено3 <td>$Израсходовано3 <td>$ost3";
echo "<tr><td>$ФИО_водителя <td>$Остаток_на_начало  <td>$Получено <td>$Израсходовано <td>$ost";
$vce = $Получено2+$Получено+$Получено3;
$vce2 =  $Израсходовано+$Израсходовано2+$Израсходовано3;
$vce3 = $ost+$ost2+$ost3;

echo "<tr><td colspan=2>Всего:  <td>$vce</td> <td>$vce2</td> <td>$vce3</td>";

  
/*  
$benz = array(
array("ФИО водителя","Остаток на начало","Получено","Израсходовано","Остаток на"), 
array("Безуглая Д.А.","1","1","1","1"), 
 );  
foreach ($benz => $ben)
  {
  echo  "$ben[0]:";
  foreach ($ben as $параметр => $pp)
    {
    echo "<html>  
<body>
<br><br><br><br>
<table border=1> 
<tr>
<td>№</td>
<td>ФИО водителя</td>
<td>Остаток на начало</td>
<td>Получено</td>
<td>Израсходовано</td>
<td>Остаток на</td>
</tr>
<tr>
<td> $pp</td>
<td> $pp</td>
<td> $pp</td>
<td> $pp</td>
<td> $pp</td>
<td> $pp</td>
</tr>
<tr>
<td colspan=2>Всего:</td>

<td></td>
<td></td>
<td></td>
<td></td>
</tr>
</table>
</body>
</html>" ,  " $pp";
    }
  }  
  
echo "  
<html>  
<body>
<br><br><br><br>
<table border=1> 
<tr>
<td>№</td>
<td>ФИО водителя</td>
<td>Остаток на начало</td>
<td>Получено</td>
<td>Израсходовано</td>
<td>Остаток на</td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td></td>
<td></td>
<td></td>
</tr>
<tr>
<td colspan=2>Всего:</td>

<td></td>
<td></td>
<td></td>
<td></td>
</tr>
</table>
</body>
</html>"
  */

?>